---
type: MEPNetworkSegmentData
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 18
tags: [revit-api, class]
---

# MEPNetworkSegmentData

`Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPNetworkSegmentData | — | `` |
| Constructor | MEPNetworkSegmentData | 2024 | `public MEPNetworkSegmentData ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDownstreamSegments | 2024 | `public IList < MEPNetworkSegmentId > GetDownstreamSegments ()` |
| Method | GetUpstreamSegments | 2024 | `public IList < MEPNetworkSegmentId > GetUpstreamSegments ()` |
| Method | IsValid | 2024 | `public bool IsValid ()` |
| Property | Coefficient | 2024 | `public double Coefficient { get ; }` |
| Property | Flow | 2024 | `public double Flow { get ; }` |
| Property | FlowState | 2024 | `public PipeFlowState FlowState { get ; }` |
| Property | FrictionFactor | 2024 | `public double FrictionFactor { get ; }` |
| Property | IsCriticalPath | 2024 | `public bool IsCriticalPath { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PressureDrop | 2024 | `public double PressureDrop { get ; }` |
| Property | RelativeRoughness | 2024 | `public double RelativeRoughness { get ; }` |
| Property | ReynoldsNumber | 2024 | `public double ReynoldsNumber { get ; }` |
| Property | SectionNumber | 2024 | `public int SectionNumber { get ; }` |
| Property | Velocity | 2024 | `public double Velocity { get ; }` |
| Property | VelocityPressure | 2024 | `public double VelocityPressure { get ; }` |